{
  "_num_labels": 9,
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-COMPANY",
    "2": "I-COMPANY",
    "3": "B-METRIC",
    "4": "I-METRIC",
    "5": "B-YEAR",
    "6": "I-YEAR",
    "7": "B-TIMERANGE",
    "8": "I-TIMERANGE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-COMPANY": 1,
    "B-METRIC": 3,
    "B-TIMERANGE": 7,
    "B-YEAR": 5,
    "I-COMPANY": 2,
    "I-METRIC": 4,
    "I-TIMERANGE": 8,
    "I-YEAR": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
